In [2]:
#importing json
import json as js
#importing pandas
import pandas as pd
cd = pd.read_json("customers.json")
print(cd)

     customer_id     customer_name      country           city
0           9780      Jessica Hart   Martinique  South William
1           9169         Amy Clark   Kazakhstan     Davisville
2           6631  Danielle Elliott      Armenia     East Danny
3           8772     Robin Mendoza       Uganda    Johnsonbury
4           8913    Abigail Miller      Namibia  Wrightchester
..           ...               ...          ...            ...
995         6357    Jessica Castro     Dominica     Deannastad
996          244    Cheryl Ramirez       Malawi  Martinezmouth
997         4490   Luis Strickland        Italy     Oneilltown
998         2984    Jennifer Kelly      Bahamas    Xavierville
999         8760    Anthony Wilson  Switzerland      Torreston

[1000 rows x 4 columns]

In [5]:
############################################ EDA (Exploratory Data Analysis) #########################################

# 1.shape of the data (shape)
# it gives the how many number of rows and columns presented in data
cd.shape

(1000, 4)

In [14]:
# 2.finding the only columns in the data (columns.tolist())
# it will gives the list of columns
cd.columns.tolist()

['customer_id', 'customer_name', 'country', 'city']

In [6]:
# 3.finding the nulls in data (isnull().sum())
# it will gives the sum of nulls in columns
cd.isnull().sum()

customer_id      0
customer_name    0
country          0
city             0
dtype: int64

In [7]:
# 4.Info of the data (info())
# it gives the information about the data
cd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   customer_id    1000 non-null   int64
 1   customer_name  1000 non-null   object
 2   country        1000 non-null   object
 3   city           1000 non-null   object
dtypes: int64(1), object(3)
memory usage: 31.4+ KB

In [8]:
# 5.finding the how many number of unique rows in each column (nunique())
# it will gives the count of unique rows in the each column 
cd.nunique()

customer_id      1000
customer_name     997
country           238
city              950
dtype: int64

In [9]:
# 6.finding the top or head rows in a data (head(n))
#it will returns the first n number of rows in the data
cd.head(8)

   customer_id      customer_name     country              city
0         9780       Jessica Hart  Martinique     South William
1         9169          Amy Clark  Kazakhstan        Davisville
2         6631   Danielle Elliott     Armenia        East Danny
3         8772      Robin Mendoza      Uganda       Johnsonbury
4         8913     Abigail Miller     Namibia     Wrightchester
5         3211    Jennifer Wright    Zimbabwe      New Erinbury
6         1211     Ricky Johnston     Belarus  North Jeremyside
7         9529  Brittney Chandler     Andorra          Bellside

In [10]:
# 7.finding the bottom or tail rows in a data (tail(n))
# it will returns the last n number of rows in the data
cd.tail(8)

     customer_id    customer_name       country              city
992         9116      Jill Gordon      Thailand  Port Francesview
993         9332   Terry Williams  Saint Martin       Sheltonside
994         9617    Mary Matthews      Zimbabwe   East Marcusberg
995         6357   Jessica Castro      Dominica        Deannastad
996          244   Cheryl Ramirez        Malawi     Martinezmouth
997         4490  Luis Strickland         Italy        Oneilltown
998         2984   Jennifer Kelly       Bahamas       Xavierville
999         8760   Anthony Wilson   Switzerland         Torreston

In [6]:
cd.duplicated()

0      False
1      False
2      False
3      False
4      False
       ...
995    False
996    False
997    False
998    False
999    False
Length: 1000, dtype: bool